PreProcessing/Modules/DirectFlatPlateModule/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../constant/inputParam"

pUinf           $Upinlet.Uinf;

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform #calc "sqr($pUinf)";

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    plate
    {
        type            zeroGradient;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
    outlet
    {
        type            codedFixedValue;
        value           uniform 0;     // dummy initialization
        name            outletPressure;
        
        codeInclude
    	#{
        	#include "fvCFD.H"
    	#};
        
        code
        #{
        	using namespace Foam;
        	const fvPatch& p = patch();
        	const vectorField& Cf = p.Cf();
        	
        	//Evaluate xmax from maximum 'x-coordinate' at outlet patch
        	 const scalar xmax = gMax(Cf.component(vector::X));
        	 
	        IOdictionary userDict
	        (
	            IOobject
	            (
	                "inputParam",
	                "constant",
	                this->db(),
	                IOobject::MUST_READ,
	                IOobject::NO_WRITE
	            )
	        );
	        const dictionary& d = userDict.subDict("Upinlet");
	        
		// Defined in 0/inputParam
		const scalar Uinf  = readScalar(d.lookup("Uinf")); // Uinf
		const scalar x0    = readScalar(d.lookup("xInlet")); //  virtual LE distance
		const scalar pinf  = Foam::pow(Uinf, 2.0);         // pinf = [pinf/rho] = uinf^2
		const scalar pa4   = readScalar(d.lookup("pa4"));
		const scalar pa3   = readScalar(d.lookup("pa3"));
		const scalar pa2   = readScalar(d.lookup("pa2"));
		const scalar pa1   = readScalar(d.lookup("pa1"));
		const scalar pa0   = readScalar(d.lookup("pa0"));
		
		// Additional for top-BC polynomial definition
		const scalar shift  = x0;                           // constant of the polynomial free-stream log(x+c)
		const scalar eps    = 1e-12;                        // keeps log argument > 0
		const scalar arg    = max(eps, xmax + shift);     
		const scalar L      = Foam::log(arg);       
		
		// Define external velocity as a polynomial
    		const scalar poly = pa4*Foam::pow(L, 4.0) + pa3*Foam::pow(L, 3.0) 
    		+ pa2*Foam::pow(L, 2.0) + pa1*L + pa0;
    		
    		const scalar Ux = Uinf * poly;
    		const scalar pout = pinf + 0.5*(sqr(Uinf) - sqr(Ux));
    		
    		// Assign boundary values 
            	scalarField& bf = *this;
            	bf = scalarField(p.size(), pout);
        #};
    }
    
        top
    {
        type            codedFixedValue;
        value           uniform 0;  // initialisation
        name            topFormulaP;
        
        code
    	#{
		using namespace Foam;

		const fvPatch&  p  = patch();
		scalarField&    bf = *this;
		const auto&     Cf = p.Cf();

   
		// Parameters 
	        IOdictionary userDict
	        (
		    IOobject
		    (
		        "inputParam",
		        "constant",
		        this->db(),
		        IOobject::MUST_READ,
		        IOobject::NO_WRITE
		    )
	        );
	        const dictionary& d = userDict.subDict("Upinlet");
	        
		// Defined in 0/inputParam
		const scalar Uinf  = readScalar(d.lookup("Uinf")); // Uinf
		const scalar x0    = readScalar(d.lookup("xInlet")); //  virtual LE distance
		const scalar pinf  = Foam::pow(Uinf, 2.0);         // pinf = [pinf/rho] = uinf^2
		const scalar pa4   = readScalar(d.lookup("pa4"));
		const scalar pa3   = readScalar(d.lookup("pa3"));
		const scalar pa2   = readScalar(d.lookup("pa2"));
		const scalar pa1   = readScalar(d.lookup("pa1"));
		const scalar pa0   = readScalar(d.lookup("pa0"));
		
		// Additional for top-BC polynomial definition
		const scalar shift  = x0;                            // constant of the polynomial free-stream log(x+c)
		const scalar eps    = 1e-12;                        // keeps log argument > 0
        	
        	forAll(bf,i)
           	{
           	    // x-coordinates
		    const scalar x   = Cf[i].x();
		    // operators
		    const scalar arg = max(eps, x + shift);     
		    const scalar L   = Foam::log(arg);          
            	    
            	    // define external velocity as a polynomial
    		    const scalar poly = pa4*Foam::pow(L, 4.0) + pa3*Foam::pow(L, 3.0) 
    		    + pa2*Foam::pow(L, 2.0) + pa1*L + pa0;
    		 
    		    const scalar Ux = Uinf * poly; 
            		
            	    bf[i] = pinf + 0.5*(Uinf*Uinf - Ux*Ux);
            	}
    	#};
    }
}


// ************************************************************************* //
